Sheet03/Aufgabe1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-15 Di 21:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Anni, Jakub, Aaron" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Syntaxfehler</a></li>
<li><a href="#orgheadline2">2. Semantik</a></li>
<li><a href="#orgheadline3">3. Pragmatikfehler</a></li>
<li><a href="#orgheadline4">4. Coding-Style</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Syntaxfehler</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>"3 a": Zwei Literale nebeneinander ohne Operatoren und vor einem "=".</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #96CBFE;">3</span> <span style="color: #ff69b4;">a</span> = a &#8727; a &#8727; a ;
</pre>
</div>
<ol class="org-ol">
<li>Whitespace zwischen "*" und "=".</li>
</ol>
<div class="org-src-container">

<pre class="src src-python">a &#8727; = <span style="color: #96CBFE;">3</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Semantik</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Tupel definiert obwohl Gleitkommazahl gemeint ist.</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff69b4;">x</span> = <span style="color: #96CBFE;">12</span> ,<span style="color: #96CBFE;">1</span>
</pre>
</div>
<ol class="org-ol">
<li>Lässt man Syntaxfehler und Pragmatikfehler außer acht, soll hier wohl \(3\cdot a \) als \(a\cdot a\cdot a\) definiert werden.</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #96CBFE;">3</span> <span style="color: #ff69b4;">a</span> = a &#8727; a &#8727; a ;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Pragmatikfehler</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Funktion len redefiniert mit `len(String)`. Es ist sehr verwirrend, wenn
builtin-Funktionen überschrieben werden.</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4c83ff;">len</span>=<span style="color: #4c83ff;">len</span> <span style="color: #8b0000;">(</span> String <span style="color: #8b0000;">)</span>
</pre>
</div>
<ol class="org-ol">
<li>Sehr langer, prosaisch geschriebener String im Programm, dessen Bedeutung für
das Programm weder in einem Kommentar beschrieben wird, noch aus dem Inhalt hervorgeht.</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff69b4;">string</span> = &#8221; This placeholder text <span style="color: #4c83ff;">is</span> gonna be HUGE . You are disgusting . I know words . I &#8592;-
have the best words . I think the only difference between me <span style="color: #4c83ff;">and</span> the other placeholder&#8592;-
text <span style="color: #4c83ff;">is</span> that I am more honest <span style="color: #4c83ff;">and</span> my words are more beautiful . Lorem Ipsum <span style="color: #4c83ff;">is</span> &#8592;-
unattractive , both inside <span style="color: #4c83ff;">and</span> out . I fully understand why it <span style="color: #4c83ff;">is</span> former users left it &#8592;-
<span style="color: #4c83ff;">for</span> something <span style="color: #4c83ff;">else</span> . They made a good decision . You know , it really does <span style="color: #4c83ff;">not</span> matter &#8592;-
what you write <span style="color: #4c83ff;">as</span> <span style="color: #4c83ff;">long</span> <span style="color: #4c83ff;">as</span> you have got a young , <span style="color: #4c83ff;">and</span> beautiful , piece of text . &#8221;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Coding-Style</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Im Variablennamen eine Zahl verwendet, die fälschlicherweise einen Wert der
Variablen impliziert.</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff69b4;">variable1</span> = <span style="color: #96CBFE;">2</span>
</pre>
</div>
<ol class="org-ol">
<li>Unnütze whitespaces eingefügt.</li>
</ol>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4c83ff;">print</span> <span style="color: #8b0000;">(</span> string + String <span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Anni, Jakub, Aaron</p>
<p class="date">Created: 2016-11-15 Di 21:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
